[
  {
    "title": "Investigating Cultural Dispersion: on the Role of Cultural Differences in Software Development Teams",
    "type": "Short Conference Paper",
    "source": "Proceedings of the 46th International Conference on Software Engineering - Doctoral Symposium",
    "authors": "<strong>S. Lambiase</strong>",
    "acronym_key": "ICSE-DS",
    "year": "2024",
    "abstract": "Software development, inherently a social activity, involves individuals across diverse geographical and cultural settings. Despite this nature, the existing Global Software Engineering research body encounters limitations, making the achieved results challenging to use by practitioners. This Ph.D. research project seeks to overcome these constraints by crafting a theoretical framework. The framework systematically captures cultural differences, exploring their impact on various aspects of software development and delving into practitioners' strategies for managing these influences. Additionally, the project aims to significantly contribute to the professional software development landscape by transferring research findings to practitioners through practical tools. This framework serves as an immediate application for professionals, fostering project success through heightened cultural awareness and adaptability, thereby enhancing developer well-being in inclusive and culturally diverse environments.",
    "topic_list": "Human Aspects | GSE | Culture",
    "downloadLink": "/assets/papers/SLambiase_ICSE_DS_2024_CulturalDispersion.pdf"
  },
  {
    "title": "Dealing with Cultural Dispersion: a Novel Theoretical Framework for Software Engineering Research and Practice",
    "type": "Full Research Paper",
    "source": "Proceedings of the 46th International Conference on Software Engineering - Software Engineering in Society (ICSE-SEIS 2024)",
    "authors": "<strong>S. Lambiase</strong>, G. Catolino, B. Della Piana, F. Ferrucci, F. Palomba",
    "acronym_key": "ICSE-SEIS",
    "year": "2024",
    "abstract": "Software development is fundamentally a team-driven process; researchers in software engineering have identified various human and social factors that can significantly impact it. Culture emerged as a critical element, and the diversity deriving from cultural differences can be highly impactful both positively and negatively. Despite existing knowledge about how culture influences software development, limitations persist. Most importantly, it makes research on culture fragmented, leading to the continual definition of new concepts that do not allow the state of the art to advance significantly, and it reduces the ability of the research to be transferred to practitioners since there is no framework designed to be understood and used by them. To address the above-mentioned limitation, this work proposed a theoretical framework of “Dealing With Cultural Dispersion”, which focuses on challenges and benefits originating from cultural differences and strategies for dealing with them. Such a framework was developed through a qualitative study using an iterative research approach, including interviews and socio-technical grounded theory for data analysis. The proposed framework was designed to reveal the tangible effects of practitioners’ culture in software development, allowing software teams to (1) clearly understand the problem and (2) implement the correct strategy for addressing it. Additionally, researchers can use this framework as a foundation to (deductively) develop a more robust and comprehensive theory in this field.",
    "topic_list": "Human Aspects | GSE | Culture | Grounded Theory",
    "downloadLink": "/assets/papers/ICSE_SEIS_2024_DealingWithCulturalDispersion_SLambiase.pdf"
  },
  {
    "title": "An Empirical Investigation into the Influence of Software Communities’ Cultural and Geographical Dispersion on Productivity",
    "type": "Full Journal Paper",
    "source": "Journal of Systems and Software (JSS)",
    "authors": "<strong>S. Lambiase</strong>, G. Catolino, F. Pecorelli, D. A. Tamburri, F. Palomba, WJ. van den Heuvel, F. Ferrucci",
    "acronym_key": "JSS",
    "year": "2023",
    "abstract": "Estimating and understanding software development productivity represent crucial tasks for researchers and practitioners. Although different works focused on evaluating the impact of human factors on productivity, a few explored the influence of cultural/geographical diversity in software development communities. More particularly, all previous treatise addresses cultural aspects as abstract concepts without providing a quantitative representation. Improved knowledge of these matters might help project managers to assemble more productive teams and tool vendors to design software analytics toolkits that may better estimate productivity. This paper has the goal of enlarging the existing body of knowledge on the factors affecting productivity by focusing on cultural and geographical dispersion of a development community—namely, how diverse a community is in terms of cultural attitudes and geographical collocation of the members who belong to it. To reach this goal, we performed a mixed-method empirical study. First, we built a statistical model relating dispersion metrics with the productivity of 25 open-source communities on Github. Then, we performed a confirmatory survey with 140 practitioners. The key results of our study indicate that cultural and geographical dispersion considerably impact productivity, thus encouraging managers and practitioners to consider such aspects during all the phases of the software development lifecycle. We conclude our paper by elaborating on the main insights from our analyses and instilling implications that may drive further research.",
    "topic_list": "Human Aspects | GSE | Culture",
    "downloadLink": "/assets/papers/SLambiase_JSS_SEAA_Extension_Productivity_2023.pdf"
  },
  {
    "title": "Security Testing in The Wild: An Interview Study",
    "type": "Short Conference Paper",
    "source": "Software Engineering and Advanced Applications",
    "authors": "D. Di Dario, V. Pontillo, <strong>S. Lambiase</strong>, F. Ferrucci, F. Palomba",
    "acronym_key": "SEAA",
    "year": "2023",
    "abstract": "Modern software systems are increasingly complex and the risk of falling into security concerns is high if these systems are not developed with a proper security mindset. Despite the empirical studies and security-oriented approaches proposed by researchers and tool vendors, we still point out a lack of knowledge on the security testing processes applied by companies to reduce risks connected to software security. In this paper, we aim to bridge this gap of knowledge by performing an interview-based study with 19 security experts to understand how companies arrange security testing and how the process of security testing is actually performed in practice. Our results highlight that some companies incorporated the figure of the security tester in the software life cycle, yet practitioners reported a lack of standardized guidelines for security testing. From a management perspective, our results suggest that the introduction of formal communication between development and security testing teams may lead to better performance.",
    "topic_list": "Security Testing | Vulnerabilities",
    "downloadLink": "/assets/papers/DiDario_SecurityTesting.pdf"
  },
  {
    "title": "QuantuMoonLight: A Low-Code Platform to Experiment with Quantum Machine Learning",
    "type": "Full Journal Paper",
    "source": "SoftwareX",
    "authors": "F. Amato et al.",
    "acronym_key": "SoftwareX",
    "year": "2023",
    "abstract": "Nowadays, machine learning is being used to address multiple problems in various research fields, with software engineering researchers being among the most active users of machine learning mechanisms. Recent advances revolve around the use of quantum machine learning, which promises to revolutionize program computation and boost software systems’ problem-solving capabilities. However, using quantum computing technologies is not trivial and requires interdisciplinary skills and expertise. For such a reason, we propose QuantuMoonLight, a community-based low-code platform that allows researchers and practitioners to configure and experiment with quantum machine learning pipelines, compare them with classic machine learning algorithms, and share lessons learned and experience reports. We showcase the architecture and main features of QuantuMoonLight, other than discussing its envisioned impact on research and practice.",
    "topic_list": "Quantum | Machine Learning | Web Application",
    "downloadLink": "/assets/papers/SofwareX_QuantuMoonLight_2022_Definitivo.pdf"
  },
  {
    "title": "Community Smell Detection and Refactoring in SLACK: The CADOCS Project",
    "type": "Tool Demo Paper",
    "source": "Proceedings of the 38th IEEE International Conference on Software Maintenance and Evolution (ICSME Tool Demo Track 2022)",
    "authors": "G. Voria, V. Pentangelo, A. Della Porta, <strong>S. Lambiase</strong>, G. Catolino, F. Palomba, F. Ferrucci",
    "acronym_key": "ICSME",
    "year": "2022",
    "abstract": "Software engineering is a human-centered activity involving various stakeholders with different backgrounds that have to communicate and collaborate to reach shared objectives. The emergence of conflicts among stakeholders may lead to undesired effects on software maintainability, yet it is often unavoidable in the long run. Community smells, i.e., sub-optimal communication and collaboration practices, have been defined to map recurrent conflicts among developers. While some community smell detection tools have been proposed in the recent past, these can be mainly used for research purposes because of their limited level of usability and user engagement. To facilitate a wider use of community smell-related information by practitioners, we present CADOCS, a client-server conversational agent that builds on top of a previous community smell detection tool proposed by Almarini et al. to (1) make it usable within a well-established communication channel like Slack and (2) augment it by providing initial support to software analytics instruments useful to diagnose and refactor community smells. We describe the features of the tool and the preliminary evaluation conducted to assess and improve robustness and usability.",
    "topic_list": "Human Aspects | Community Smells | Conversational Agents",
    "downloadLink": "/assets/papers/ICSME_CADOCS_2022.pdf"
  },
  {
    "title": "\"There and Back Again?\" On the Influence of Software Community Dispersion Over Productivity",
    "type": "Full Research Paper",
    "source": "Proceedings of the 25th Euromicro Conference on Software Engineering and Advanced Applications (SEAA 2022)",
    "authors": "<strong>S. Lambiase</strong>, G. Catolino, F. Palomba, D. A. Tamburri, F. Palomba, W. J. Van Den Heuvel, F. Ferrucci",
    "acronym_key": "SEAA",
    "year": "2022",
    "abstract": "Estimating and understanding productivity still represents a crucial task for researchers and practitioners. Researchers spent significant effort identifying the factors that influence software developers' productivity, providing several approaches for analyzing and predicting such a metric. Although different works focused on evaluating the impact of human factors on productivity, little is known about the influence of cultural/geographical diversity in software development communities. Indeed, in previous studies, researchers treated cultural aspects like an abstract concept without providing a quantitative representation. This work provides an empirical assessment of the relationship between cultural and geographical dispersion of a development community—namely, how diverse a community is in terms of cultural attitudes and geographical collocation of the members who belong to it—and its productivity. To reach our aim, we built a statistical model that contained product and socio-technical factors as independent variables to assess the correlation with productivity, i.e., the number of commits performed in a given time. Then, we ran our model considering data of 25 open-source communities on GitHub. Results of our study indicate that cultural and geographical dispersion impact productivity, thus encouraging managers and practitioners to consider such aspects during all the phases of the software development lifecycle.",
    "topic_list": "Human Aspects | GSE | Culture",
    "downloadLink": "/assets/papers/There_and_Back_Again_Euromicro22.pdf"
  },
  {
    "title": "Good Fences Make Good Neighbours? On the Impact of Cultural and Geographical Dispersion on Community Smells",
    "type": "Full Research Paper",
    "source": "Proceedings of the 44th International Conference on Software Engineering - Software Engineering in Society (ICSE-SEIS 2022)",
    "authors": "<strong>S. Lambiase</strong>, G. Catolino, D. A. Tamburri, A. Serebrenik, F. Palomba, F. Ferrucci",
    "acronym_key": "ICSE-SEIS",
    "year": "2022",
    "abstract": "Software development is de facto a social activity that often involves people from all places to join forces globally. In such common instances, project managers must face social challenges, e.g., personality conflicts and language barriers, which often amount literally to “culture shock”. In this paper, we seek to analyze and illustrate how cultural and geographical dispersion—that is, how much a community is diverse in terms of its members’ cultural attitudes and geographical collocation—influence the emergence of collaboration and communication problems in open-source communities, a.k.a. community smells, the socio-technical precursors of unforeseen, often nasty organizational conditions amounting collectively to the phenomenon called social debt. We perform an extensive empirical study on cultural characteristics of GitHub developers, and build a regression model relating the two types of dispersion—cultural and geographical—with the emergence of four types of community smells, i.e., Organizational Silo, Lone Wolf, Radio Silence, and Black Cloud. Results indicate that cultural and geographical factors influence collaboration and communication within open-source communities, to an extent which incites—or even more interestingly mitigates, in some cases—community smells, e.g., Lone Wolf, in development teams. Managers can use these findings to address their own organizational structure and tentatively diagnose any nasty phenomena related to the conditions under study.",
    "topic_list": "Human Aspects | GSE | Community Smells | Culture",
    "downloadLink": "/assets/papers/Good_Fences_Make_Good_Neighbours.pdf"
  },
  {
    "title": "Just-In-Time Test Smell Detection and Refactoring: The DARTS Project",
    "type": "Tool Demo Paper",
    "source": "Proceedings of the 28th International Conference on Program Comprehension (ICPC)",
    "authors": "<strong>S. Lambiase</strong>, A. Cupito, F. Pecorelli, A. De Lucia, F. Palomba",
    "acronym_key": "ICPC",
    "year": "2021",
    "abstract": "Test smells represent sub-optimal design or implementation solutions applied when developing test cases. Previous research has shown that these smells may decrease both maintainability and effectiveness of tests and, as such, researchers have been devising methods to automatically detect them. Nevertheless, there is still a lack of tools that developers can use within their integrated development environment to identify test smells and refactor them. In this paper, we present DARTS (Detection And Refactoring of Test Smells), an Intellij plug-in which (1) implements a state-of-the-art detection mechanism to detect instances of three test smell types, ie, General Fixture, Eager Test, and Lack of Cohesion of Test Methods, at commit-level and (2) enables their automated refactoring through the integrated APIs provided by Intellij.",
    "topic_list": "Technical Debt | Test Smells",
    "downloadLink": null
  }
]
  